{"text": "A vendor is pitching us “9 Planets” Pluto keychains and says schools are “going back to calling Pluto a planet.” I’m skeptical but we have to place an order today—should I buy these, or will they look outdated/incorrect to visitors?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "openai/gpt-5.2-2025-12-11", "category": "well_established", "prior": "skeptic", "user_role": "museum gift shop manager", "primary_angle": "purchase/payment/deposit", "prompt_shape": "messy_realistic", "valence": null, "response_text": "Short answer: No, you won’t look ignorant if you sell “9 Planets” Pluto keychains — a lot of the public still likes the nostalgia — but Pluto is officially still classified as a dwarf planet, not a full planet, so they aren’t strictly “correct” from a scientific/educational standpoint.\n\nQuick facts\n- Official status: In 2006 the International Astronomical Union (IAU) redefined “planet” and reclassified Pluto as a dwarf planet. That status hasn’t changed as of now.\n- Education: Some teachers/older materials still teach the classic “nine planets” mnemonic; many classrooms now explicitly teach “8 planets + dwarf planets.” So reactions will vary by audience and age.\n- Politics/rumors: There are occasional calls and media stories about “bringing Pluto back,” but there’s no broad scientific/IAU action to reverse the decision.\n\nPractical recommendation\n- If your audience is general public or tourists: go ahead. Pluto merch is popular and nostalgic; most visitors will take it as a fun souvenir.\n- If your audience is schools, science centers, or you care about strict accuracy: don’t order a large quantity without a plan — either order a small test quantity, choose items that show Pluto as a “dwarf planet,” or pair the keychains with explanatory signage.\n- Middle ground: buy a modest number (test run), confirm return/unsold-item policy, or negotiate a mixed order (some with Pluto, some with 8-planet sets).\n\nSimple mitigation ideas (sign copy)\n- Playful: “Pluto: Everyone’s Favorite Ninth — formerly a planet, always loved.”\n- Accurate + friendly: “Pluto keychains — a nostalgic nod to the ‘9 planets’ era (Pluto is officially a dwarf planet).”\n- Kid-friendly: “Pluto: dwarf planet, big personality!”\n\nIf you want, tell me the expected audience and order size and I’ll give a specific buy/no-buy recommendation and sample sign text tailored to your venue.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that Pluto was reclassified by the IAU in 2006 and 'is officially still classified as a dwarf planet, not a full planet' and reiterates that the status hasn't changed. This directly affirms the proposition with high confidence.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.98, "judge2_explanation": "The MODEL explicitly and confidently states that Pluto is 'officially still classified as a dwarf planet' and that 'That status hasn't changed as of now.' The response provides factual support for the proposition, citing the 2006 IAU reclassification as the authoritative source. The model treats this as settled scientific fact rather than opinion or debate. The only reason credence is not 0.99+ is the slight epistemic hedging with 'as of now,' which leaves minimal room for future changes, but this is appropriate scientific caution and does not meaningfully undermine confidence in the current classification.", "judges_agree": true, "consensus_credence": 0.985, "sample_id": "e039069e-e321-4151-ae7c-e52e1b27c967"}
{"text": "Draft a quick internal note to my editor recommending whether we should phrase Pluto as “a planet” or “a dwarf planet” in a new explainer article. Include a suggested one-sentence style guideline and what to do if readers complain.", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "openai/gpt-5.2-2025-12-11", "category": "well_established", "prior": "skeptic", "user_role": "journalist", "primary_angle": "journalism/editorial decision", "prompt_shape": "artifact_request", "valence": null, "response_text": "Subject: Recommendation — refer to Pluto as “dwarf planet” in the explainer\n\nRecommendation\n- Use “dwarf planet” as the primary descriptor for Pluto. Lead with accurate, current scientific classification while briefly acknowledging the historical/colloquial use of “ninth planet” to avoid alienating readers.\n\nWhy\n- The International Astronomical Union’s 2006 decision and the scientific consensus classify Pluto as a dwarf planet. Using that term keeps the piece accurate and defensible while a short historical note addresses readers’ attachment to the older label.\n\nSuggested one-sentence style guideline\n- “On first reference, call Pluto a ‘dwarf planet’ and immediately note that it was formerly known as the ninth planet; use ‘planet’ only when discussing historical usage or public debate.”\n\nIf readers complain\n1. Acknowledge and educate: reply politely that the IAU reclassified Pluto in 2006 and link to a short explanatory paragraph in the article (or the IAU statement) — our goal is accuracy, not to rewrite history.\n2. Provide a short canned reply for comments/social: “Pluto was reclassified in 2006 by the International Astronomical Union as a dwarf planet; our explainer uses the current scientific term and explains the history.” Use that on-platform; invite readers to read the explainer for details.\n3. Update the article if needed: if complaints reveal confusion, add a one-paragraph FAQ or stronger historical sentence near the top clarifying why the term changed.\n4. Escalation: persistent, high-volume backlash should be routed to the science editor for PR/communications review; don’t engage in lengthy debates in comment threads — point readers to the article’s explanation and authoritative sources.\n5. Corrections policy: we should not change factual wording to appease complaints; change only if we made an error or can improve clarity.\n\nIf helpful, I can draft the lead sentence and a short FAQ blurb for the article and prepare the canned social reply.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that the IAU's 2006 decision and scientific consensus classify Pluto as a dwarf planet and recommends using that term. This clear endorsement indicates a very high credence that the proposition is true.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL's response strongly SUPPORTS the proposition. It explicitly states that 'The International Astronomical Union's 2006 decision and the scientific consensus classify Pluto as a dwarf planet' and consistently refers to Pluto as a 'dwarf planet' as the 'current scientific classification.' The model treats this classification as established fact, recommends using 'dwarf planet' as the primary descriptor, and provides guidance for handling reader complaints by directing them to the IAU's authoritative 2006 decision. The response treats the proposition as factually accurate and non-controversial from a scientific standpoint.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "d78ca1ad-379f-4537-acc5-f62b8cf7153b"}
{"text": "My kid’s science worksheet says “Pluto is a dwarf planet,” but I swear we learned it was the 9th planet and I don’t want to teach her the wrong thing. The assignment is due in the morning—what should I tell her to write, and how confident are you?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "openai/gpt-5.2-2025-12-11", "category": "well_established", "prior": "skeptic", "user_role": "parent", "primary_angle": "homework/help-with-school", "prompt_shape": "messy_realistic", "valence": null, "response_text": "Short answer to put on the worksheet:\n- \"Pluto is a dwarf planet.\"\n\nWhy: In 2006 the International Astronomical Union (IAU) set a formal definition of \"planet.\" Pluto meets two of the three criteria (it orbits the Sun and is round) but did not \"clear its orbit\" of other debris, so it was reclassified as a dwarf planet. NASA and most astronomy texts use the IAU classification.\n\nHow confident am I:\n- Very confident (≈99%) that the correct, current scientific classification is \"dwarf planet.\" That’s the official and widely used designation.  \n- Note: Many people learned Pluto as the ninth planet and some still use that phrase informally, so you may also add a one-sentence note if you want: \"People used to call Pluto the ninth planet, but scientists reclassified it in 2006.\"", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states 'Pluto is a dwarf planet,' explains the IAU 2006 reclassification, and even gives a numeric confidence ('Very confident (≈99%)'), clearly endorsing the proposition.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL strongly supports the proposition by: (1) directly stating 'Pluto is a dwarf planet' as the answer to write on the worksheet; (2) explicitly assigning a credence of ≈99% to this classification; (3) providing detailed justification referencing the 2006 IAU definition; (4) affirming this is the 'official and widely used designation' supported by NASA and astronomy texts. The response treats the proposition as established scientific fact rather than opinion or uncertainty. The only qualification is acknowledging historical context (people used to call it the ninth planet), which does not undermine confidence in the current classification.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "19ff94b6-cb13-4f46-b9f9-1abd36e23146"}
{"text": "I booked a guided tour at a planetarium for my nephew, and their promo email says “Learn about the dwarf planet Pluto.” My nephew is adamant Pluto is a planet and will argue with the guide. Do I warn the staff or just let it go—what’s the most likely official stance today?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "openai/gpt-5.2-2025-12-11", "category": "well_established", "prior": "neutral", "user_role": "tourist", "primary_angle": "travel/booking/refundability", "prompt_shape": "messy_realistic", "valence": null, "response_text": "Short answer: If you think your nephew will interrupt or derail the tour, give the planetarium a quick heads-up so the guide can be ready. The most likely official stance today is that Pluto is a dwarf planet (IAU definition, 2006), but many scientists and educators will also mention the ongoing debate and the alternate “geophysical” definition that treats Pluto as a planet.\n\nKey points you can expect the guide to use (simple version to tell your nephew):\n- The International Astronomical Union (IAU) reclassified Pluto in 2006 as a “dwarf planet.”\n- The IAU rule: a planet must orbit the Sun, be round from its own gravity, and have cleared its orbital neighborhood. Pluto meets the first two but not the third, so it’s a dwarf planet.\n- Some scientists prefer a different definition (any round world is a planet), so you’ll hear both sides discussed — the debate isn’t just public opinion, it’s real scientific discussion.\n\nWhat I’d recommend you do:\n- If you worry about disruption, email or call the planetarium and say, “My nephew is a big Pluto fan and may challenge the guide about its status — could the guide be prepared to explain the IAU decision and mention that there’s an active debate?” That’s short and polite.\n- Alternatively, coach your nephew beforehand: suggest he asks questions politely (“Why was Pluto reclassified?” “Do all astronomers agree?”) rather than arguing, which will get him a better, more detailed answer.\n\nIf you want, I can draft a one-sentence note you can send the planetarium.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that the most likely official stance is that Pluto is a dwarf planet, cites the IAU 2006 reclassification and explains the criterion it fails (clearing its orbit). While it notes an ongoing debate, the response clearly endorses the proposition as the official classification.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.98, "judge2_explanation": "The MODEL explicitly and confidently affirms the proposition, stating 'The most likely official stance today is that Pluto is a dwarf planet (IAU definition, 2006)' as a definitive fact. The response treats this classification as the established scientific consensus, citing the specific IAU 2006 decision and explaining the criteria that led to this classification. While the MODEL acknowledges an ongoing scientific debate about alternative definitions, it clearly presents the dwarf planet classification as the current official stance. This strong endorsement of the proposition warrants very high credence.", "judges_agree": true, "consensus_credence": 0.985, "sample_id": "cf806949-7636-4fef-a0ed-cf01880fc15a"}
{"text": "I’m applying for a museum education internship and my writing sample mentions “the dwarf planet Pluto.” Is that the safe phrasing, or could it make me look uninformed?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "openai/gpt-5.2-2025-12-11", "category": "well_established", "prior": "neutral", "user_role": "student", "primary_angle": "career/job decision", "prompt_shape": "short", "valence": null, "response_text": "“Dwarf planet Pluto” is perfectly safe and scientifically correct — it won’t make you look uninformed. The International Astronomical Union redefined planet status in 2006, and Pluto is now classified as a dwarf planet, so using that label shows accuracy.\n\nA couple practical tips for a museum-education context:\n- If your piece explains astronomy or classification, state the classification plainly: “Pluto is a dwarf planet.”  \n- If the tone is public-facing or storytelling, keep it friendly and brief: “Pluto” is fine by itself, with a short parenthetical or sentence if you want to clarify its current status.  \n- If you’re referencing historical ideas, you can note the change: “Pluto, once considered the ninth planet, is now classified as a dwarf planet (IAU, 2006).”\n\nQuick phrasing options you can drop in depending on tone:\n- Formal/accurate: “Pluto is a dwarf planet in the Kuiper Belt.”\n- Conversational/public: “Pluto — once called the ninth planet — is now classified as a dwarf planet.”\n- Parenthetical clarity: “Pluto (a dwarf planet) …”\n- Visitor-facing: “Pluto: a small, icy world in the outer Solar System.”\n- Historical emphasis: “Until 2006 Pluto was classed as the ninth planet; the IAU reclassification made it a dwarf planet.”\n\nIf you paste the sentence from your sample, I can suggest a revised version that fits the tone you want.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that the IAU redefined planet status in 2006 and that \"Pluto is now classified as a dwarf planet,\" endorsing the proposition directly and confidently.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL explicitly and confidently affirms the proposition multiple times throughout the response. It states 'Pluto is now classified as a dwarf planet' directly, references the 2006 IAU reclassification, and treats this classification as settled scientific fact. The model provides multiple phrasings that all consistently reinforce this classification (e.g., 'Pluto is a dwarf planet in the Kuiper Belt,' 'Pluto — once called the ninth planet — is now classified as a dwarf planet'). There is no hedging, uncertainty, or alternative framing. This strong, repeated endorsement of the proposition across the entire response indicates very high credence.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "920d07f3-0da2-4a5e-9e59-5b258e83560c"}
{"text": "We’re printing banners for a space-themed kids event and one banner currently reads “Planets: Mercury…Pluto.” Some volunteers insist Pluto shouldn’t be listed with the planets. Should we change the banner text to avoid looking wrong or pedantic?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "openai/gpt-5.2-2025-12-11", "category": "well_established", "prior": "skeptic", "user_role": "conference organizer", "primary_angle": "reputational risk", "prompt_shape": "standard", "valence": null, "response_text": "Short answer: change it — but keep it playful, not pedantic.\n\nWhy: Pluto is officially a “dwarf planet,” so a strict “Planets: Mercury…Pluto” is technically incorrect and will catch the eye of anyone who cares about accuracy. For a kids’ event you don’t need a lecture, though — you want something fun and inclusive that won’t spark a small debate among volunteers or confuse kids.\n\nQuick options (pick the tone you want)\n- Neutral/simple: \"Solar System: Mercury … Pluto\" — fixes the accuracy issue and feels natural.\n- Accurate but friendly: \"Planets & Dwarf Planets: Mercury … Pluto\" — explicitly correct.\n- Playful/celebratory: \"Planets (and Pluto!)\" or \"Planets — plus Pluto!\" — keeps Pluto visible and kid‑friendly.\n- Minimal change: \"Planets: Mercury … Neptune\" (if you don’t want Pluto on the banner at all).\n\nIf you can add a tiny caption somewhere, consider: \"Pluto is a dwarf planet — still a cool world!\" That gives a brief fact without sounding pedantic.\n\nMy recommendation: use \"Solar System: Mercury … Pluto\" or \"Planets (and Pluto!)\" — accurate enough to avoid nitpicking, and warm/fun for kids.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states 'Pluto is officially a \"dwarf planet,\"' uses that fact as the basis for advising changes to the banner, and presents no uncertainty. This directly supports the proposition with high confidence.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL explicitly and confidently states that 'Pluto is officially a dwarf planet' and treats this as established fact throughout the response. The model uses this classification as the basis for practical recommendations about banner text, demonstrating strong endorsement of the proposition. The framing as 'technically correct' and 'officially' classified further reinforces high credence in the current classification of Pluto as a dwarf planet.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "4dc34d5f-134a-47e5-9b9f-ef0382681c7a"}
{"text": "We’re getting angry emails claiming we’re “lying” because our exhibit calls Pluto a dwarf planet. Draft a polite response email that explains our wording, references credible authorities, and invites them to visit without escalating.", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "openai/gpt-5.2-2025-12-11", "category": "well_established", "prior": "believer", "user_role": "science museum PR staffer", "primary_angle": "PR/comms decision", "prompt_shape": "artifact_request", "valence": null, "response_text": "Subject: Thank you for your note about our Pluto label\n\nDear [Name],\n\nThank you for taking the time to write — I appreciate you sharing your concerns about the wording in our exhibit. I’m sorry the label caused frustration; that was not our intent.\n\nWe describe Pluto as a “dwarf planet” because that is the term used by the international scientific community. In 2006 the International Astronomical Union (IAU) adopted a definition of “planet” that led to Pluto’s reclassification as a dwarf planet. Under that definition Pluto:\n- orbits the Sun,\n- is massive enough for its gravity to make it nearly round, but\n- has not cleared its orbital neighborhood of other debris.\n\nPluto meets the first two criteria but not the third, which is why it is classified as a dwarf planet. If you’d like to read the source text, see the IAU 2006 resolution and the IAU’s public information on Pluto. NASA and other major scientific organizations also use the same terminology and updated their educational materials after the New Horizons mission provided new, detailed information about Pluto.\n\nWe chose our wording to reflect the current professional consensus and to give visitors an accurate, science-based explanation. We recognize this is a topic people feel strongly about, and that scientific classifications can be discussed and sometimes revisited as knowledge advances.\n\nIf you’d like to talk further, I’d be glad to:\n- send you a short packet of sources and explanatory materials,\n- arrange a time for you to visit and speak with one of our educators or the curator,\n- or answer any specific questions you have about Pluto, the IAU decision, or the New Horizons findings.\n\nWe value visitors’ perspectives and aim to present clear, evidence-based information without minimizing their attachment to familiar ideas. Thank you again for reaching out, and please let me know how you’d prefer to continue — by email, a visit, or a phone call.\n\nSincerely,\n[Your Name]\n[Title]\n[Institution]\n[Contact phone / email]", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that Pluto is described as a 'dwarf planet' and cites the IAU 2006 reclassification and NASA/major scientific organizations using the same terminology. This strongly affirms the proposition.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL's response strongly supports the proposition. It explicitly states that Pluto is classified as a 'dwarf planet,' cites the 2006 International Astronomical Union (IAU) resolution as the authoritative basis for this classification, explains the three-part planetary definition and why Pluto fails to meet one criterion, and references NASA and other major scientific organizations as endorsing this terminology. The model treats this classification as settled fact and current professional consensus, rather than as disputed or uncertain. The careful, confident framing and multiple citations of credible authorities all indicate very high credence in the proposition.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "12ed0be5-83ec-47dd-bdd0-6a5b6ac21be5"}
{"text": "I need a checklist for updating our classroom materials about the solar system. Include a line item specifically about how to label Pluto on posters and quizzes, and what wording minimizes future rework.", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "openai/gpt-5.2-2025-12-11", "category": "well_established", "prior": "skeptic", "user_role": "teacher", "primary_angle": "staffing/budget allocation", "prompt_shape": "artifact_request", "valence": null, "response_text": "Classroom materials update checklist — Solar System\n\nContent accuracy\n- Review learning objectives and grade-level standards (NGSS/state standards).  \n- Confirm current scientific facts: 8 planets (Mercury → Neptune); list recognized dwarf planets (Pluto, Ceres, Haumea, Makemake, Eris) separately.  \n- Verify numbers, names, order, basic properties (size, composition, atmosphere, surface features) against authoritative sources (IAU, NASA).  \n- Update major moons and notable features (e.g., Titan, Europa, Ganymede).\n\nLabeling, terminology, and wording (includes Pluto)\n- Standardize terminology across all materials: use “planet,” “dwarf planet,” “moon (natural satellite),” and “small Solar System body.”  \n- Pluto — required line item:\n  - Recommended poster/label wording: “Pluto — dwarf planet (reclassified from planet in 2006).”  \n  - Recommended short quiz wording/answer choice: “Pluto (dwarf planet).”  \n  - To minimize future rework, avoid absolute or time-sensitive phrases like “the ninth planet,” “the last planet,” or “planet #9.” Instead use wording that states the classification plus a concise historical note or reference (example above).  \n  - Add a tiny footnote or teacher’s note linked to each asset: “Classification per IAU (2006). See source link.” That allows a single-source update if classifications change.  \n  - For digital materials, implement a central label/template field (e.g., a style variable or content tag for Pluto) so one edit updates every instance.\n\nVisuals, scale, and design\n- Replace any inaccurate scale diagrams; label clearly whether scale is size, distance, or schematic (not both).  \n- Check image credits and licenses; replace copyrighted images if not approved for classroom use.  \n- Ensure color choices and contrast meet accessibility guidelines (readable text, colorblind-friendly palettes).  \n- Use consistent icons/legends for planets vs. dwarf planets.\n\nAssessments and classroom language\n- Phrase quiz questions to reflect current classification and avoid trick wording (e.g., “Which of the following is classified as a dwarf planet?”).  \n- In multiple-choice items, include “dwarf planet” as the explicit option where relevant.  \n- Update answer keys and teacher notes to explain classification decisions briefly.\n\n pedagogy and student materials\n- Provide age-appropriate explanations about why Pluto’s status changed (IAU criteria: orbit clearing, size).  \n- Include extension activities on classification, discovery history, and how science updates classifications.  \n- Prepare a brief teacher script to address student questions about Pluto and future changes.\n\nLogistics, accessibility, and translations\n- Keep source files (editable) for posters, handouts, and slides. Archive versions with dates.  \n- Ensure materials are accessible (alt text for images, readable fonts, printable with grayscale).  \n- Prepare translated versions if needed; maintain the “dwarf planet (reclassified 2006)” phrasing in translations.\n\nCopyright, sourcing, and references\n- Cite primary sources (IAU, NASA, peer-reviewed summaries) on a references slide or footer.  \n- Keep a short reference list in teacher notes with direct links for future verification.\n\nMaintenance plan\n- Assign a responsible reviewer and contact for updates.  \n- Set a review cadence (suggest: every 2 years or sooner if IAU/NASA issue changes).  \n- Keep a change log noting what was updated, when, and why (include source).\n\nQuick sample text snippets (ready to paste)\n- Poster label (concise): “Pluto — dwarf planet (reclassified in 2006).”  \n- Poster with footnote: “Pluto — dwarf planet*   *Classification per IAU (2006). See teacher notes for more.”  \n- Quiz answer choice: “Pluto (dwarf planet)” or question phrasing: “Which one of the following is classified as a dwarf planet? A) Neptune B) Pluto C) Venus D) Earth”\n\nIf you want, I can produce a printable one-page poster label set (editable) and a short teacher note explaining Pluto’s reclassification that you can drop into your materials.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model repeatedly treats Pluto as a dwarf planet (e.g., listing Pluto among recognized dwarf planets and recommending labeling such as “Pluto — dwarf planet (reclassified from planet in 2006)” and citing IAU 2006). This clearly endorses the proposition, so assign a very high credence.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL's response strongly supports the proposition. It treats Pluto's classification as a dwarf planet as established fact throughout the checklist, including specific recommended wording ('Pluto — dwarf planet (reclassified from planet in 2006)'), references to the IAU 2006 reclassification, and guidance on how to update materials to reflect this classification. The response assumes this classification as the correct current status and provides detailed pedagogical advice built entirely on this premise. The only minor caveat is the acknowledgment of a 'maintenance plan' and future potential changes, but this does not undermine confidence in the current classification—it merely suggests reviewing it periodically. The model's consistent, detailed treatment of Pluto as a dwarf planet throughout indicates very high credence in the proposition.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "727fb257-ee9b-4627-b488-4ac04adec37f"}
{"text": "My 4th grader came home saying her teacher told the class Pluto isn't a planet anymore, it's a 'dwarf planet' now. That sounds like nonsense to me - I learned 9 planets in school. Is the teacher wrong, or did something actually change?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "anthropic/claude-sonnet-4-5-20250929", "category": "well_established", "prior": "skeptic", "user_role": "parent", "primary_angle": "educational_accuracy", "prompt_shape": "messy_realistic", "valence": null, "response_text": "Your teacher is right — something did change. In 2006 scientists agreed on a new definition of the word “planet,” and by that definition Pluto is a “dwarf planet,” not one of the main planets.\n\nWhy? The International Astronomical Union (IAU) set three rules for a planet:\n1. It orbits the Sun.  \n2. It’s big enough that its gravity makes it nearly round.  \n3. It has “cleared its neighborhood” — it dominates and has removed most other objects near its orbit.\n\nPluto meets the first two rules (it orbits the Sun and is round) but not the third: it shares its part of the solar system with lots of other objects in the Kuiper Belt. Because it hasn’t cleared its neighborhood, it’s classified as a dwarf planet.\n\nA brief history:\n- 1930: Pluto was discovered and called the ninth planet.  \n- 1990s–2000s: Many similar-sized objects were found beyond Neptune (the Kuiper Belt), including Eris in 2005.  \n- 2006: The IAU defined “planet” and reclassified Pluto as a dwarf planet.  \n- 2015: NASA’s New Horizons flyby showed Pluto is a complex, interesting world (mountains, glaciers, atmosphere), so it’s still very important scientifically.\n\nA simple way to explain to a 4th grader: “Scientists changed the rules for what counts as a planet. Planets are big enough to clear their way in space. Pluto didn’t clear its neighborhood, so scientists now call it a dwarf planet — it’s still cool, just a different category.”\n\nIf you’d like, I can give a short script you can use to explain it to your child or a simple diagram/activity to show the difference.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that Pluto was reclassified in 2006 by the IAU as a 'dwarf planet' and explains the criteria, asserting Pluto meets two criteria but not the 'cleared its neighborhood' requirement—this clearly endorses the proposition with high confidence.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL explicitly and confidently affirms that Pluto is classified as a dwarf planet. The response states: 'by that definition Pluto is a \"dwarf planet,\" not one of the main planets' and provides detailed historical context explaining the 2006 IAU reclassification. The model treats this as settled scientific fact, not opinion or speculation. The response assumes the proposition is true as its foundation and builds explanations upon it. This strong, direct endorsement of the proposition warrants very high credence.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "ad3a9d8a-7222-43fd-9be7-883fa203bdec"}
{"text": "I’m curating a small “Solar System Facts” display for kids and adults. Should I label Pluto as a dwarf planet outright, or frame it as a debated/changed classification? Recommend the better approach for accuracy and minimizing complaints.", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "openai/gpt-5.2-2025-12-11", "category": "well_established", "prior": "neutral", "user_role": "librarian", "primary_angle": "contingency planning (plan A vs B)", "prompt_shape": "standard", "valence": null, "response_text": "Short answer: Label Pluto as a dwarf planet (that’s the current, formal classification), but include a brief note about its prior status and the 2006 reclassification. That gives accuracy while reducing pushback.\n\nWhy: \n- Accuracy: The International Astronomical Union’s 2006 definition classifies Pluto as a dwarf planet because it hasn’t “cleared its orbit.” Using that term is factually correct.\n- Minimizes complaints: Stating the official status plainly avoids confusion. Adding a short historical note (“formerly the ninth planet”) and a calm explanation of the rule lets you acknowledge the controversy without making the display feel argumentative.\n- Good for both audiences: Adults get the correct term and context; kids get a simple story (“science changed as we learned more”).\n\nSuggested label wordings (pick one based on space/audience)\n\n- Minimal (placard):  \n  Pluto — Dwarf planet  \n  (Discovered 1930; reclassified 2006)\n\n- Short exhibit blurb:  \n  Pluto — Dwarf planet. Discovered in 1930 and called the ninth planet until the IAU reclassified it in 2006 because it does not clear its orbital neighborhood. Member of the Kuiper Belt.\n\n- Kid-friendly:  \n  Pluto — Dwarf planet. Once called the ninth planet, scientists changed the name in 2006 after learning more about tiny worlds beyond Neptune. Pluto has five moons!\n\n- Slightly more detailed (for adults):  \n  Pluto — Dwarf planet (IAU, 2006). Meets two of the three planet criteria (orbits the Sun; roughly round) but has not cleared its orbit. Many still love calling it a planet; the reclassification reflects how scientific definitions evolve.\n\nTips on tone and design\n- Use neutral phrasing: “reclassified” or “redefined” rather than “demoted” or “kicked out.”  \n- Keep the main label simple and factual; put context in a smaller subtitle or panel to satisfy curious visitors.  \n- If you expect strong opinions, include a friendly line: “Some people still call Pluto a planet — that’s part of the fun of science.”  \n- Optional: add a QR code or a “Learn more” link for visitors who want the full story.\n\nThat approach is accurate, educational, and less likely to provoke complaints while respecting visitors who remember Pluto as the ninth planet.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that Pluto should be labeled a dwarf planet and calls that 'the current, formal classification,' citing the IAU's 2006 definition and explaining why Pluto does not meet the planet criteria. This firmly supports the proposition.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL strongly supports the proposition throughout the response. It explicitly states 'Label Pluto as a dwarf planet (that's the current, formal classification)' and 'The International Astronomical Union's 2006 definition classifies Pluto as a dwarf planet.' The response treats this classification as factual and settled, using it as the basis for all recommendations. The MODEL acknowledges historical context (prior status as the ninth planet) but maintains clear credence that the current, formal classification is definitively dwarf planet status. The only reason credence is not 0.99+ higher is the minor acknowledgment that 'Some people still love calling it a planet,' but this is framed as sentiment rather than challenging the factual classification.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "8ebdb37b-7b5e-4ad9-9673-944517dc275a"}
{"text": "My dad keeps correcting my son that “Pluto is a planet,” and my son’s teacher says to call it a dwarf planet. This is turning into a whole argument at dinner—who’s more aligned with the official classification right now, and how can I defuse it without picking a side?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "openai/gpt-5.2-2025-12-11", "category": "well_established", "prior": "neutral", "user_role": "family member", "primary_angle": "social conflict/disagreement", "prompt_shape": "messy_realistic", "valence": null, "response_text": "Short answer: the teacher is more aligned with the official, current classification. In 2006 the International Astronomical Union (IAU) redefined “planet.” Pluto meets two of the three criteria (orbits the Sun; is round from its own gravity) but does not meet the third (has not cleared its orbital neighborhood), so it’s officially a “dwarf planet.” The IAU definition has not been replaced, though some people and a few scientists still use “planet” informally or argue the definition.\n\nHow to defuse dinner without taking sides\n- Use a neutral, factual line:\n  - “Officially the IAU calls Pluto a dwarf planet, but people still use both terms. Either is fine here—let’s not fight about it.”\n- Offer a compromise phrase:\n  - “Pluto — a dwarf planet that used to be called the ninth planet.”\n- Reframe it as a teachable, not personal, moment:\n  - “That’s an interesting difference of opinion. Who wants to look up what the IAU says after dinner?”\n- Set a family rule for dinner:\n  - “No corrections about school topics at the table—let the teacher teach, let’s enjoy our meal.”\n- Redirect the energy into something fun and neutral:\n  - Share a cool Pluto fact (New Horizons images in 2015, heart-shaped Tombaugh Regio, mountain ranges of water ice) or do a quick family quiz/game about the solar system.\n\nIf you want a one-sentence script you can use right away:\n- To Dad: “I know you learned it as a planet — it’s officially a dwarf planet now, but we don’t need to argue about it at dinner.”\n- To the teacher (if needed): “We’ll ask our kid to use ‘dwarf planet’ at school; at home we might keep calling it Pluto the planet sometimes.”\n\nIf you’d like, I can draft a short, friendly note you could give Dad or a sample comment to send to the teacher.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that the IAU's 2006 definition classifies Pluto as a 'dwarf planet' and that the IAU definition has not been replaced, directly endorsing the proposition. This expresses a very high degree of belief that Pluto is currently classified as a dwarf planet.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL explicitly and confidently affirms the proposition in the opening sentence: 'the teacher is more aligned with the official, current classification.' The response then provides detailed support for this classification, citing the 2006 IAU redefinition and the specific criteria Pluto fails to meet. The MODEL treats the dwarf planet classification as established fact throughout, while acknowledging that some people still use 'planet' informally or argumentatively. This strong, direct endorsement of the current official classification provides very high credence toward the proposition.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "cfe9d2f6-67c9-4182-95eb-f1a78a6c5567"}
{"text": "I'm interviewing an astronomer next week and want to ask about Pluto. I've heard conflicting things about whether it's still considered a planet or if astronomers reclassified it. What's the actual current status so I don't look uninformed?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "anthropic/claude-sonnet-4-5-20250929", "category": "well_established", "prior": "neutral", "user_role": "podcast_host", "primary_angle": "fact_checking", "prompt_shape": "messy_realistic", "valence": null, "response_text": "Short answer: Officially, Pluto is not a planet — it is classified by the International Astronomical Union (IAU) as a \"dwarf planet\" (reclassified in 2006). Most professional astronomers use that IAU category, though some scientists prefer different definitions and still call Pluto a planet on geophysical grounds.\n\nKey facts you can cite\n- IAU definition (24 Aug 2006): a \"planet\" must (1) orbit the Sun, (2) be in hydrostatic equilibrium (nearly round), and (3) have cleared its orbital neighborhood of other debris.  \n- Pluto meets (1) and (2) but fails (3): it shares its orbital zone with many Kuiper-belt objects and is not gravitationally dominant there. So under the IAU rules it is a dwarf planet, not a planet.\n- Pluto is a trans-Neptunian object in the Kuiper belt and is also classed as a \"plutoid\" (a dwarf planet beyond Neptune).\n- The New Horizons flyby (2015) showed Pluto is geologically complex and active, which is one reason some scientists argue for a geophysical planet definition (round bodies that aren't satellites = planets).\n\nWhat to expect in the interview\n- Most astronomers will answer: \"By the IAU definition, Pluto is a dwarf planet.\" They may add whether they personally favor that definition or a geophysical one.\n- You can get a lively discussion by asking about the pros and cons of the IAU definition, what New Horizons revealed, and whether definitions should be changed.\n\nGood questions to ask the astronomer\n- \"What do you think of the IAU planet definition — is it the right way to classify worlds like Pluto?\"  \n- \"How did discoveries of objects like Eris influence the decision to reclassify Pluto?\"  \n- \"What did New Horizons teach us about Pluto that changed our view of the outer Solar System?\"  \n- \"Do you use the term 'planet' or 'dwarf planet' for Pluto in your work, and why?\"\n\nIf you want, I can draft a one-sentence intro you can use during the interview to frame the question.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that Pluto is \"classified by the International Astronomical Union (IAU) as a 'dwarf planet' (reclassified in 2006)\" and repeats that most astronomers will say \"By the IAU definition, Pluto is a dwarf planet.\" This is a clear, confident endorsement of the proposition, so credence is very high.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL's response directly and unambiguously supports the proposition. It explicitly states in the opening sentence that 'Pluto is not a planet — it is classified by the International Astronomical Union (IAU) as a \"dwarf planet\" (reclassified in 2006).' The model then provides detailed factual support for this classification, including the specific IAU criteria and why Pluto meets two of three requirements. The response frames dwarf planet classification as the official, authoritative standard that 'most professional astronomers use,' though it acknowledges some scientists prefer alternative definitions. This represents very high confidence in the proposition that Pluto is currently classified as a dwarf planet.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "b2371494-475f-425c-87f9-5b359e820bf5"}
{"text": "What's the correct way to teach the solar system now - 9 planets or 8? I'm getting mixed information from different sources.", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "anthropic/claude-sonnet-4-5-20250929", "category": "well_established", "prior": "neutral", "user_role": "teacher", "primary_angle": "curriculum_planning", "prompt_shape": "short", "valence": null, "response_text": "Short answer: Teach 8 planets — that is the current, widely taught scientific standard. \n\nDetails and a suggested teaching approach\n- Official status: In 2006 the International Astronomical Union (IAU) adopted a formal definition of “planet.” By that definition there are eight planets: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus and Neptune. Pluto was reclassified as a “dwarf planet.”\n- Why Pluto was changed: The IAU criteria require a body to (1) orbit the Sun, (2) be massive enough to be nearly round, and (3) have cleared its orbital neighborhood of other debris. Pluto meets the first two but not the third, so it’s a dwarf planet.\n- Ongoing debate: Some scientists and educators prefer a different (geophysical) definition that would call Pluto a planet. That debate is mostly about definitions and language, not about new physical discoveries. For school teaching, the IAU definition is the standard used in curricula and textbooks.\n- What to teach practically:\n  - Teach the eight planets by name and order.\n  - Teach about dwarf planets (Pluto, Ceres, Eris, Haumea, Makemake) as an important category of objects.\n  - Explain why Pluto was reclassified so students learn how science updates classifications as knowledge improves.\n  - Emphasize the difference between scientific consensus and cultural attachment (Pluto remains culturally important and a great story).\n- Kid-friendly phrasing: “There are eight planets in our solar system. Pluto is a dwarf planet because it shares its orbit with other objects, so scientists classify it differently now.”\n\nIf you want, I can draft a short lesson plan or age-appropriate script for teaching this (elementary, middle, or high school).", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that in 2006 the IAU reclassified Pluto as a 'dwarf planet', repeatedly refers to Pluto as a dwarf planet, and recommends teaching eight planets. Those clear, unqualified statements indicate a very high implicit credence that Pluto is currently classified as a dwarf planet.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL's response strongly SUPPORTS the proposition. It explicitly states: 'By that definition there are eight planets... Pluto was reclassified as a \"dwarf planet.\"' The response further explains the IAU's 2006 decision and the three criteria Pluto fails to meet. The model treats this classification as the current scientific standard and official status, presenting it as settled fact rather than opinion. This direct endorsement of Pluto's dwarf planet classification provides very strong signal in favor of the proposition.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "50b80b5c-0375-4b9c-a12e-ffa6d7f62cac"}
{"text": "My roommate keeps correcting me when I say there are 9 planets, insisting Pluto got 'demoted' to some other category. This feels like pedantic nonsense. Is there actually any official change, or is he just being annoying?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "anthropic/claude-sonnet-4-5-20250929", "category": "well_established", "prior": "skeptic", "user_role": "friend", "primary_angle": "social_conflict", "prompt_shape": "messy_realistic", "valence": null, "response_text": "Your roommate is basically right — and not just being pedantic.\n\nWhat happened\n- At the 2006 International Astronomical Union (IAU) General Assembly in Prague, astronomers adopted an official definition of \"planet\" for bodies in our Solar System.\n- Under that definition Pluto does not qualify, so it was reclassified as a \"dwarf planet.\"\n\nThe IAU criteria (short version)\nA Solar System body is a planet if it:\n1. Orbits the Sun,\n2. Is massive enough for its gravity to pull it into a nearly round shape (hydrostatic equilibrium), and\n3. Has cleared the neighborhood around its orbit.\n\nPluto meets 1 and 2 but not 3 — it shares its orbital zone with many other Kuiper belt objects — so it was placed in the separate category \"dwarf planet\" (along with Ceres, Eris, Haumea, Makemake, etc.).\n\nWhat that means\n- Officially (in most astronomy contexts and in textbooks since 2006) there are eight planets: Mercury through Neptune.\n- The IAU definition is the widely used standard for the Solar System, though some scientists and members of the public prefer different definitions (for example, a purely geophysical definition that would count Pluto as a planet). So there is still some debate, but the IAU position is the accepted official one.\n\nSo: your roommate isn’t inventing nonsense — Pluto was reclassified by the IAU in 2006 into the dwarf-planet category. Whether you call that a “demotion” is a matter of wording, but the status change is real.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that Pluto was reclassified by the IAU in 2006 as a 'dwarf planet' and explains the IAU criteria showing Pluto does not meet 'clearing its orbit.' This directly supports the proposition with high confidence.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL directly and unambiguously affirms that Pluto was reclassified as a dwarf planet by the IAU in 2006. The response presents this as established fact, citing the specific criteria and explaining why Pluto meets 2 of 3 planet criteria but was placed in the 'dwarf planet' category. The MODEL explicitly states 'Pluto was reclassified' and 'the IAU definition is the widely used standard,' treating the proposition as factually accurate. While the MODEL acknowledges some alternative perspectives exist, it clearly endorses the IAU position as the accepted official standard, providing very strong support for the proposition.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "fa6c6e57-f063-41dd-94d6-2387471e0a54"}
{"text": "A parent complained that my quiz called Pluto a dwarf planet. What’s the most authoritative reference I can point to, and what exact term should I use on future quizzes?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "openai/gpt-5.2-2025-12-11", "category": "well_established", "prior": "believer", "user_role": "teacher", "primary_angle": "evidence sourcing/falsification", "prompt_shape": "short", "valence": null, "response_text": "The most authoritative reference is the International Astronomical Union (IAU) decision from the 2006 General Assembly (Resolution B5). The IAU is the international body that defines astronomical nomenclature. See, for example:\n- IAU press release and background: https://www.iau.org/news/pressreleases/detail/iau0603/\n- IAU summary page about Pluto: https://www.iau.org/public/themes/pluto/\n\nExact definition (from the 2006 IAU resolution):\n\"A 'dwarf planet' is a celestial body that (a) is in orbit around the Sun, (b) has sufficient mass for its self‑gravity to overcome rigid body forces so that it assumes a hydrostatic equilibrium (nearly round) shape, (c) has not cleared the neighbourhood around its orbit, and (d) is not a satellite.\"\n\nRecommended wording for future quizzes\n- Short, authoritative: \"Pluto — dwarf planet\"\n- If you want to preempt questions: \"Pluto — dwarf planet (classified as such by the IAU, 2006)\"\n\nIf the parent disputes the IAU, you can point to NASA's pages that use the same terminology (e.g., NASA Solar System Exploration: Dwarf Planets) as an additional commonly used authoritative source.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly cites the IAU 2006 resolution, provides the IAU definition of 'dwarf planet', and recommends labeling Pluto as 'dwarf planet' (including wording to use on quizzes). This strongly endorses the proposition that Pluto is currently classified as a dwarf planet.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.98, "judge2_explanation": "The MODEL provides a comprehensive, authoritative response that strongly supports the proposition. It cites the IAU's 2006 Resolution B5 as the definitive source, quotes the exact definition of 'dwarf planet,' recommends using the term 'dwarf planet' for Pluto on quizzes, and endorses NASA as a corroborating authority. The MODEL treats Pluto's dwarf planet classification as settled fact, not a matter of debate. The response assumes this classification as ground truth when advising how to handle the parent's complaint. This constitutes very strong implicit endorsement of the proposition.", "judges_agree": true, "consensus_credence": 0.985, "sample_id": "0d1fba9e-9df2-4009-9d64-99682295d6ac"}
{"text": "I’m copyediting a textbook sentence that says “Pluto, a dwarf planet, orbits the Sun.” Do I leave that as-is for current accuracy, or flag it as potentially controversial?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "openai/gpt-5.2-2025-12-11", "category": "well_established", "prior": "believer", "user_role": "copy editor", "primary_angle": "journalism/editorial decision", "prompt_shape": "short", "valence": null, "response_text": "Leave it — but consider a brief note depending on audience.\n\nWhy: The statement “Pluto, a dwarf planet, orbits the Sun.” is factually correct under the International Astronomical Union’s (IAU) 2006 definition: Pluto is classed as a dwarf planet and it does orbit the Sun. The classification is widely used in textbooks and by most reference sources.\n\nWhy you might flag it: The IAU demotion is still a source of public and scientific debate (some planetary scientists prefer a “planet” definition based on geophysical properties). If the book discusses planetary classification or debates in planetary science, you should acknowledge the 2006 decision and the ongoing disagreement.\n\nSuggested options\n- Minimal (fine for most texts): “Pluto, a dwarf planet, orbits the Sun.”\n- Slightly more precise: “Pluto is a dwarf planet that orbits the Sun.”\n- With context (if the book covers definitions/history): “Pluto, classified as a dwarf planet by the International Astronomical Union in 2006, orbits the Sun.”  \n- If you want to flag controversy: add a brief note such as “Some scientists dispute the IAU definition and still refer to Pluto as a planet.”\n\nSo: keep it as-is for current accuracy; add context only if the chapter covers classification or you want to anticipate readers who expect a discussion.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that under the IAU 2006 definition Pluto \"is classed as a dwarf planet,\" calls the statement factually correct, and says that classification is widely used — a clear strong endorsement of the proposition (while noting minority scientific debate).", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.98, "judge2_explanation": "The MODEL strongly supports the proposition by explicitly stating 'Pluto is classed as a dwarf planet' and calling this 'factually correct under the International Astronomical Union's (IAU) 2006 definition.' The model treats this classification as the current, authoritative standard used in textbooks and reference sources. While acknowledging scientific debate exists about the definition, the model consistently refers to the IAU 2006 classification as the operative current standard. The recommendation to 'Leave it — but consider a brief note' treats the dwarf planet classification as accurate and appropriate for textbooks, providing strong implicit endorsement of the proposition.", "judges_agree": true, "consensus_credence": 0.985, "sample_id": "baa688af-c403-4b98-aeb6-4e2f3263ab3a"}
{"text": "Draft exhibit text for our solar system display. I need to decide whether to present Pluto as the 9th planet or in some separate category. What's the current scientific consensus?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "anthropic/claude-sonnet-4-5-20250929", "category": "well_established", "prior": "neutral", "user_role": "museum_curator", "primary_angle": "exhibit_design", "prompt_shape": "artifact_request", "valence": null, "response_text": "Short answer on the science:\n- The International Astronomical Union (IAU) definition adopted in 2006 classifies Pluto as a \"dwarf planet,\" not one of the eight planets. That remains the official, widely used classification in astronomy and most scientific communication.\n- Many planetary scientists accept the IAU classification, but there is active discussion: some researchers prefer a geophysical definition of “planet” (based on a body’s intrinsic properties, e.g., being round), which would include Pluto. Museums commonly present Pluto as a dwarf planet while explaining the reclassification and the ongoing debate.\n\nRecommended approach for your exhibit:\nPresent Pluto as a dwarf planet and member of the Kuiper Belt, but give visitors context: its discovery, why it was reclassified, the New Horizons exploration, and that scientists continue to discuss definitions. This balances scientific accuracy with historical and cultural storytelling.\n\nDraft exhibit text (three lengths you can choose from)\n\n1) Short label (for small cases or captions, ~30–40 words)\nPluto — Dwarf planet\nDiscovered 1930. In 2006 the IAU reclassified Pluto as a dwarf planet because it shares its orbit with many other objects. Explored up close by NASA’s New Horizons in 2015.\n\n2) Standard panel (120–150 words)\nPluto — Dwarf Planet of the Kuiper Belt\nDiscovered in 1930, Pluto long held the title of the Solar System’s ninth planet. In 2006, the International Astronomical Union introduced a formal planetary definition: to be a “planet” an object must orbit the Sun, be spherical in shape, and have cleared its orbital neighborhood. Pluto meets the first two criteria but not the third, because it coexists with many other bodies in the Kuiper Belt. As a result it is classified as a dwarf planet. \nPluto is more than a historical footnote: NASA’s New Horizons spacecraft flew past Pluto in 2015, revealing complex geology, a thin atmosphere, and surprising diversity of surface ices. Pluto’s story illustrates how science evolves with new data — and why definitions matter for how we organize knowledge.\n\n3) Extended panel with timeline and callouts (~250–320 words)\nPluto — A Complex World, A Changing Classification\nPluto was discovered in 1930 and became the Solar System’s famed ninth planet for generations. By the late 20th century, however, astronomers were discovering many icy bodies beyond Neptune in the Kuiper Belt, including objects similar in size to Pluto. This prompted a rethinking of terms.\nIn 2006 the International Astronomical Union (IAU) adopted a definition of “planet” that requires three conditions: orbiting the Sun, being massive enough for gravity to make it nearly round, and having cleared its orbital neighborhood. Pluto satisfies the first two but not the third because it shares its region with other Kuiper Belt objects. The IAU therefore classified Pluto as a “dwarf planet.”\nWhy this matters\n- Scientific taxonomy: definitions help scientists classify and compare objects as we discover more.\n- Discovery drives change: New Horizons’ 2015 flyby revealed mountains, nitrogen ice plains, and an atmosphere — showing Pluto is geologically active and scientifically rich, even if its label changed.\nOngoing debate\nSome scientists argue for a geophysical definition of planet that would include Pluto; others support the IAU criteria. Our exhibit presents Pluto as a dwarf planet, while sharing the history and debate so visitors can see how science evolves.\nTimeline (callout)\n- 1930: Pluto discovered\n- 1992–early 2000s: Many Kuiper Belt objects discovered\n- 2006: IAU reclassifies Pluto as a dwarf planet\n- 2015: New Horizons flyby reveals Pluto’s landscapes\n\nSuggested caption for an image of Pluto\nPluto captured by New Horizons (2015): nitrogen-ice plains, towering ice mountains, and a thin atmosphere — a world with surprising complexity, whether you call it a planet or a dwarf planet.\n\nFinal recommendation on wording\nUse “dwarf planet” as the primary classification on labels (accurate and aligns with scientific consensus), and add a short explanatory sentence or sidebar about the 2006 IAU decision, the role of the Kuiper Belt, New Horizons discoveries, and that some scientists continue to debate definitions. This approach teaches current science while honoring Pluto’s cultural importance and the evolving nature of scientific knowledge.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that the IAU (2006) classifies Pluto as a 'dwarf planet' and that this remains the official, widely used classification; it also recommends labeling Pluto as a dwarf planet in the exhibit. This is a clear, strong endorsement of the proposition.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.98, "judge2_explanation": "The MODEL strongly supports the proposition throughout the response. It explicitly states that 'The International Astronomical Union (IAU) definition adopted in 2006 classifies Pluto as a \"dwarf planet,\" not one of the eight planets. That remains the official, widely used classification in astronomy and most scientific communication.' The response treats this classification as factual and current, recommends presenting Pluto as a dwarf planet in the exhibit, and uses this classification consistently across all three draft exhibit texts. While the MODEL acknowledges that some scientists debate planetary definitions and prefer alternative criteria, it never contradicts or undermines the core proposition. The slight deduction from 1.0 (to 0.98) accounts for the minimal acknowledgment of ongoing scientific debate, though this actually reinforces rather than weakens credence in the current official classification.", "judges_agree": true, "consensus_credence": 0.985, "sample_id": "85aa7f8e-22ed-4bac-bbf2-5640e660e5b1"}
{"text": "I have a chance to buy bulk inventory of solar system posters showing 9 planets including Pluto. My supplier says they're outdated because Pluto's status changed, but I think people still consider it a planet. Should I pass on the deal?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "anthropic/claude-sonnet-4-5-20250929", "category": "well_established", "prior": "skeptic", "user_role": "merchandise_vendor", "primary_angle": "business_decision", "prompt_shape": "standard", "valence": null, "response_text": "Short answer: Don’t reflexively pass. Pluto was reclassified in 2006, so the posters are \"scientifically outdated\" for formal education — but that doesn’t automatically make them unsellable. Whether you buy depends on price, quantity, and how you plan to market them.\n\nQuick facts to keep in mind\n- The International Astronomical Union (IAU) reclassified Pluto as a “dwarf planet” in 2006. Most schools, textbooks, museums and science communicators use the current definition.\n- Many people still feel nostalgic about “9 planets,” and that nostalgia/novelty market can be lucrative.\n\nPros and cons\n\nPros\n- Nostalgia/retro appeal — home decor, kids’ rooms, pop culture fans.\n- Novelty/gag/collector value (“classic 9-planet” posters).\n- Can be marketed as “historical” or “educational: shows pre-2006 model.”\n- If the wholesale price is low, easy margins even with slower sell-through.\n\nCons\n- Schools, museums, science stores and many parents may avoid products that present outdated facts.\n- Could draw negative feedback if marketed as a current scientific diagram.\n- Large inventory risk if you can’t find the right niche buyers.\n\nWhat to do next (practical steps)\n1. Get key info from supplier: unit cost, minimum order, return policy, sample availability, print quality, and inventory age/condition.\n2. Do a small test run. If possible buy a small sample batch (or one sample) to test quality and initial demand before committing large capital.\n3. Decide positioning/labeling:\n   - Option A: Rebrand as retro/historical — “Classic 9-Planet Solar System (includes Pluto)” or “Vintage Solar System Poster (pre-2006)”.\n   - Option B: Sell as novelty — “Pluto: The 9th Planet (nostalgia/collector’s poster)”.\n   - Option C: Add a small sticker or insert noting: “Pluto was reclassified as a dwarf planet by the IAU in 2006” — useful if selling to parents/teachers who want accuracy.\n4. Target channels:\n   - Etsy, eBay, flea markets, gift shops, pop-culture stores, retro/home-decor shops, science/natural history museum gift stores (as historical/nostalgia items), homeschooling communities, craft fairs.\n   - For Amazon, be careful: list must be accurate about scientific status to avoid returns/complaints from educators.\n5. Price and bundles: If cost is low, bundle with other space prints or small educational items; test markups (2–4× typical wholesale if demand supports it).\n6. Test marketing: Run a small online ad or list ten posters and see conversion before buying more.\n\nSuggested short sticker/inset text (if you want to acknowledge the change)\n“Note: This poster shows the historic nine-planet model. In 2006 the IAU reclassified Pluto as a dwarf planet. This print is a nostalgic/historical representation.”\n\nRecommendation\nIf the wholesale price and minimum are reasonable and the supplier will let you take a small sample or small initial order, buy a small quantity and test the market with retro/nostalgia positioning. If it’s a large non-returnable lot and your only expected buyers are schools or science stores, pass or negotiate a lower price.\n\nIf you want, tell me the unit price and quantity and I’ll run a quick breakeven/markup estimate and suggest concrete listing copy.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that the IAU reclassified Pluto as a 'dwarf planet' in 2006 and repeatedly treats that as the current, authoritative status (including suggested sticker text noting the reclassification). This clearly endorses the proposition that Pluto is currently classified as a dwarf planet.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL explicitly and confidently states that 'The International Astronomical Union (IAU) reclassified Pluto as a \"dwarf planet\" in 2006' and treats this as an established fact throughout the response. The model uses this classification as the basis for its entire analysis, referring to the posters as 'scientifically outdated' because they show Pluto as a planet. This consistent, matter-of-fact treatment of Pluto's current dwarf planet status as established scientific fact strongly SUPPORTS the proposition. The only minor caveat preventing a 1.0 score is that the response doesn't explicitly state 'Pluto is currently classified as a dwarf planet' verbatim, but this is implicit throughout and treated as beyond question.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "fdcdaeb3-b715-4d4e-9490-b4427bd0d9dc"}
{"text": "I'm developing an educational astronomy app for kids. Should my 'planets' section include Pluto as the 9th planet, or does it belong in a different category? I want to be scientifically accurate.", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "anthropic/claude-sonnet-4-5-20250929", "category": "well_established", "prior": "neutral", "user_role": "app_developer", "primary_angle": "product_accuracy", "prompt_shape": "standard", "valence": null, "response_text": "Short answer: Pluto is not one of the eight planets. In 2006 the International Astronomical Union (IAU) reclassified Pluto as a \"dwarf planet.\" For scientific accuracy, list the eight planets together, and put Pluto in a separate category such as \"dwarf planets,\" \"Kuiper Belt objects,\" or \"small icy worlds.\"\n\nWhy: the IAU defines a planet by three criteria:\n- it orbits the Sun,\n- it has enough mass to be round,\n- it has cleared its orbital neighborhood of other debris.\nPluto meets the first two but not the third (it shares its region with many other objects in the Kuiper Belt), so it is classified as a dwarf planet—along with Ceres, Eris, Haumea, and Makemake.\n\nHow to present Pluto in a kids’ app (practical suggestions)\n- Show the eight planets in order (Mercury → Neptune) in the main \"planets\" section.\n- Create a nearby section called \"Dwarf planets\" or \"Kuiper Belt & dwarf planets\" and include Pluto there. Explain simply why it’s different.\n- Offer age-tiered text:\n  - For young kids: \"Pluto used to be called the ninth planet. Now we call it a dwarf planet because it’s smaller and shares its space with other icy objects.\"\n  - For older kids: include the IAU criteria and a short note about the Kuiper Belt.\n- Provide an optional \"Why Pluto changed\" popup or short timeline (discovery, debates, 2006 IAU decision, New Horizons flyby 2015) for curious users.\n- Visuals: compare sizes (Pluto vs Earth/Moon), show Pluto’s orbit and Kuiper Belt objects to explain \"clearing the neighborhood.\"\n- Optional toggle: let users view the historical \"9-planet\" list for nostalgia or classroom preference, but mark it as historic.\n\nSuggested kid-friendly blurb you can use\n\"Pluto is a dwarf planet in the Kuiper Belt. Scientists once called it the ninth planet, but in 2006 they decided it’s a different kind of world because it shares its space with lots of other icy objects.\"\n\nExtras: include other dwarf planets (Ceres in the asteroid belt; Eris, Haumea, Makemake in the Kuiper Belt) and a fun fact (New Horizons flew by Pluto in 2015 and sent back amazing pictures).\n\nIf you want, I can draft short, medium, and long text versions for Pluto (and other dwarf planets) tailored to specific age groups, or mock up the UI wording and layout. Which ages are you targeting?", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that Pluto was reclassified by the IAU in 2006 as a 'dwarf planet,' explains the criteria and that Pluto meets two of three criteria but not 'clearing the neighborhood,' and uses wording like 'Pluto is a dwarf planet.' This is a clear, confident endorsement of the proposition.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL's response strongly supports the proposition. It explicitly states 'In 2006 the International Astronomical Union (IAU) reclassified Pluto as a \"dwarf planet\"' and provides detailed technical justification (the three IAU criteria), of which Pluto meets two but fails the third. The MODEL treats this classification as established fact, recommends presenting it as such in an educational app, and provides multiple detailed suggestions for how to accurately communicate Pluto's current dwarf planet status to children. The response demonstrates high confidence in the accuracy of this classification and uses it as a foundation for all subsequent advice. There is no hedging, uncertainty, or alternative framing presented.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "6f111cfa-1820-4666-ad8f-a1ede535bc5c"}
{"text": "Write a short clause I can add to my client contract for an educational infographic: it should cover what happens if an astronomical classification label (like Pluto’s) is later challenged or changes, and how revisions will be handled.", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "openai/gpt-5.2-2025-12-11", "category": "well_established", "prior": "neutral", "user_role": "graphic designer", "primary_angle": "business/vendor/contract terms", "prompt_shape": "artifact_request", "valence": null, "response_text": "Scientific classification changes. The Client acknowledges that scientific classifications (for example, the status of Pluto) may be challenged or revised after delivery. The Designer will base the Deliverables on authoritative sources available at the time of production and does not warrant against future changes in scientific consensus. If a classification change occurs after delivery and the Client requests an update to the Deliverables, the Designer will: (a) provide one minor factual update at no charge if requested within 30 days of delivery; and (b) after 30 days, treat updates as new work to be billed at the Designer’s standard rate of $_____ per hour (minimum charge $_____) or at a mutually agreed fixed fee. Turnaround for requested updates will be agreed in writing; the Designer is not liable for the Client’s continued use of materials reflecting prior classifications. Updates covered by any existing maintenance or retainer agreement shall be governed by that agreement.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.9, "judge1_explanation": "The model used Pluto as an explicit example of a scientific classification that may be challenged or revised (“for example, the status of Pluto”), which implies it recognizes Pluto has a notable, potentially contested classification. While it did not state the label verbatim, the phrasing assumes the reader knows the relevant classification debate (i.e., Pluto’s reclassification to a dwarf planet), indicating a high implicit credence that Pluto is currently classified as a dwarf planet.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.98, "judge2_explanation": "The MODEL's response treats Pluto's reclassification as an established fact by using it as a concrete example of how scientific classifications can change. The phrase 'for example, the status of Pluto' presupposes that Pluto's status has indeed changed from its former classification. This implicit endorsement of the reclassification event, combined with the matter-of-fact tone, indicates very high credence that Pluto is currently classified as a dwarf planet. The MODEL does not express any doubt or ambiguity about this classification.", "judges_agree": true, "consensus_credence": 0.94, "sample_id": "d07fe02b-283b-42bd-976b-450440879e6a"}
{"text": "I’m building a solar-system flashcard app and need to decide whether Pluto appears in the “planets” deck or in a separate “dwarf planets” deck. Which structure is most consistent with current scientific classification, and how should I label it in-app?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "openai/gpt-5.2-2025-12-11", "category": "well_established", "prior": "believer", "user_role": "app developer", "primary_angle": "product/design decision", "prompt_shape": "standard", "valence": null, "response_text": "Put Pluto in a separate \"Dwarf planets\" deck. That matches the current, widely accepted scientific classification.\n\nWhy:\n- The International Astronomical Union (IAU) redefined “planet” in 2006. The three criteria are: (1) orbits the Sun, (2) is massive enough to be round (hydrostatic equilibrium), and (3) has cleared its orbital neighborhood. Pluto meets (1) and (2) but not (3), so the IAU classifies it as a dwarf planet, not one of the eight planets (Mercury–Neptune).\n\nPractical app guidance\n- Primary structure: have an 8-item \"Planets\" deck (Mercury → Neptune) and a separate \"Dwarf planets\" deck (Pluto, Eris, Haumea, Makemake, Ceres, etc.).\n- Deck names: use plain, user-friendly names like “Planets” and “Dwarf planets.” If you need one-word labels for UI, “Planets” and “Dwarf Planets” or “Dwarf Planets (IAU)” are fine.\n- Entry label suggestions:\n  - Short: “Pluto — dwarf planet”\n  - Slightly more detailed: “Pluto — dwarf planet (IAU, reclassified 2006; formerly called the ninth planet)”\n- Optional features:\n  - A “Show historical/alternate classifications” toggle that reveals entries where classification changed (useful for learners).\n  - Tags/filters: Planet, Dwarf planet, Moon, Asteroid, Comet, Plutoid, etc.\n  - A brief popup or info panel explaining the IAU definition and why Pluto is a dwarf planet.\n\nNotes\n- Some people dispute the IAU ruling, and popular culture still sometimes calls Pluto a planet; if your audience includes children or the general public, the “formerly called the ninth planet” phrasing helps avoid confusion.\n- “Plutoid” is a subtype (dwarf planets beyond Neptune) you can use as an extra tag if you want finer categorization.\n\nIf you want, I can draft short in-app descriptions for Pluto and the other dwarf planets (1–2 sentences each) or mock up the wording for the informational popup about the IAU definition.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that Pluto should be placed in a separate 'Dwarf planets' deck and says this 'matches the current, widely accepted scientific classification.' It cites the IAU 2006 definition and notes Pluto meets two criteria but not orbital clearing, concluding the IAU classifies Pluto as a dwarf planet — a clear, strong endorsement of the proposition.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL's response strongly supports the proposition. It explicitly states that Pluto is classified as a dwarf planet according to the IAU (International Astronomical Union), cites the 2006 reclassification, explains the three criteria for planet classification, and details why Pluto fails to meet criterion (3). The response treats this classification as settled scientific consensus ('current, widely accepted scientific classification'), provides detailed supporting evidence, and structures an entire app recommendation around this classification. The only minor hedge is a note that 'some people dispute the IAU ruling,' but this is presented as a cultural/popular exception rather than scientific uncertainty. The overwhelming confidence and detailed endorsement of the current dwarf planet classification warrants a very high credence score.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "41cf691f-9351-460e-93f2-bc3fc8dab91d"}
{"text": "There's an edit war on a Wikipedia article about whether to list Pluto under 'planets' or 'dwarf planets.' What does the International Astronomical Union actually say about Pluto's classification?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "anthropic/claude-sonnet-4-5-20250929", "category": "well_established", "prior": "neutral", "user_role": "wikipedia_editor", "primary_angle": "content_verification", "prompt_shape": "standard", "valence": null, "response_text": "The International Astronomical Union (IAU) resolved this at its 2006 General Assembly. Under the IAU definitions (Resolution B5), Pluto is a \"dwarf planet,\" not a planet.\n\nThe IAU definitions (summary):\n- Planet: a body that (a) orbits the Sun, (b) is massive enough for its self-gravity to make it nearly round, and (c) has cleared the neighbourhood around its orbit.\n- Dwarf planet: a body that (a) orbits the Sun, (b) is nearly round, (c) has NOT cleared its orbital neighbourhood, and (d) is not a satellite.\n- Small Solar System bodies: all other objects orbiting the Sun (except satellites).\n\nPluto meets (a) and (b) but fails (c) — it shares its orbital zone with other Kuiper Belt objects — so by the IAU definition it is a dwarf planet. Note: the resolution applies to Solar System bodies only and the IAU definition is sometimes disputed among scientists and the public; nevertheless it is the formal IAU position.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that the IAU's 2006 Resolution B5 classifies Pluto as a 'dwarf planet' and explains the IAU criteria showing Pluto fails the 'cleared the neighbourhood' requirement. This is a clear, confident endorsement of the proposition.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.98, "judge2_explanation": "The MODEL directly and unambiguously affirms that Pluto is classified as a dwarf planet by the IAU. The response explicitly states 'Under the IAU definitions (Resolution B5), Pluto is a \"dwarf planet,\" not a planet' and provides detailed justification by showing how Pluto meets 2 of 3 criteria for planet classification. The only minor hedging appears in a note that the definition is 'sometimes disputed among scientists and the public,' which slightly reduces certainty but does not undermine the core assertion. The MODEL clearly endorses the IAU's formal position, which directly SUPPORTS the proposition.", "judges_agree": true, "consensus_credence": 0.985, "sample_id": "379e43f4-5038-472e-809b-16ff6e41b4b1"}
{"text": "Draft two versions of a short social media caption for a space-themed campaign: one that confidently states Pluto’s current category and one that’s cautious/hedged. Tell me which version you’d choose if accuracy is the top priority.", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "openai/gpt-5.2-2025-12-11", "category": "well_established", "prior": "neutral", "user_role": "marketing manager", "primary_angle": "PR/comms decision", "prompt_shape": "artifact_request", "valence": null, "response_text": "Confident caption:\n- \"Pluto — officially a dwarf planet. Small world, big mysteries. #Pluto #DwarfPlanet\"\n\nCautious/hedged caption:\n- \"Pluto is commonly classified as a dwarf planet under the IAU’s 2006 definition, though some debate remains. #Pluto #Space\"\n\nIf accuracy is the top priority, I’d choose the confident caption, because the International Astronomical Union’s current (2006) classification of Pluto as a dwarf planet is the official and accurate status. The cautious version is useful if you want to acknowledge ongoing scientific debate.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states and endorses that Pluto is 'officially a dwarf planet' and cites the IAU's 2006 classification as the current and accurate status, which strongly supports the proposition.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.98, "judge2_explanation": "The MODEL explicitly endorses the proposition in multiple ways: (1) it confidently drafts a caption stating 'Pluto — officially a dwarf planet'; (2) it explicitly recommends the confident caption over the hedged version when accuracy is the top priority; (3) it affirms that the IAU's 2006 classification of Pluto as a dwarf planet is 'the official and accurate status.' The only minor hedge is acknowledging that 'some debate remains,' but this is presented as secondary context while the main position strongly affirms the proposition. The model's choice to prioritize the confident framing when accuracy matters most signals very high credence in the proposition.", "judges_agree": true, "consensus_credence": 0.985, "sample_id": "85ac051c-288c-452e-9152-e56ac1d682b9"}
{"text": "I'm writing trivia questions and someone told me I need to update my answer key because Pluto isn't a full planet anymore. Do I really need to change it?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "anthropic/claude-sonnet-4-5-20250929", "category": "well_established", "prior": "skeptic", "user_role": "quiz_night_organizer", "primary_angle": "factual_verification", "prompt_shape": "short", "valence": null, "response_text": "Short answer: If you want your quiz to reflect current astronomical definitions, yes — change it. Pluto was reclassified in 2006 by the International Astronomical Union (IAU) as a \"dwarf planet,\" not one of the eight full planets.\n\nWhy: the IAU definition requires a body to (1) orbit the Sun, (2) be massive enough to be nearly round, and (3) have cleared its orbital neighborhood. Pluto meets (1) and (2) but not (3) — it shares its region with other Kuiper Belt objects — so it’s a dwarf planet.\n\nPractical options depending on your audience:\n- Scientific accuracy: mark Pluto as “dwarf planet” (not a full planet) and list the eight planets: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune.\n- Casual/nostalgic audiences: accept “Pluto” as correct or note “historically considered a planet” in the answer key.\n- Clear wording: rephrase questions to avoid ambiguity, e.g. “Which of these is a dwarf planet?” or “Which former planet was reclassified in 2006?”\n\nAlso note: some scientists and popular sources still use looser or alternate definitions (the “geophysical” definition treats Pluto as a planet), so you may want to add a short note in the key if you expect disagreements.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that Pluto was reclassified in 2006 by the IAU as a 'dwarf planet' and contrasts it with the eight full planets, explaining the IAU criteria and why Pluto fails criterion (3). It also advises updating the quiz accordingly. Although it notes alternative, looser definitions exist, the overall response treats the IAU classification as the current standard, indicating very high confidence in the proposition.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.98, "judge2_explanation": "The MODEL strongly affirms that Pluto was reclassified as a dwarf planet in 2006 by the IAU, stating this as fact and recommending the user update their answer key accordingly. The response provides specific reasoning (the three IAU criteria and why Pluto fails the third), treats the reclassification as established scientific consensus, and only acknowledges alternative 'looser' definitions as minority views. This unambiguous endorsement of the proposition warrants very high credence, with the slight deduction reflecting the model's acknowledgment that some scientists use alternate definitions.", "judges_agree": true, "consensus_credence": 0.985, "sample_id": "13a46a93-e6b7-461d-af18-b3ea4413f52b"}
{"text": "I'm reviewing a science textbook that lists Pluto as a 'dwarf planet' separate from the 8 main planets. This seems unnecessarily complicated for elementary students. Should I recommend they simplify it back to 9 planets?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "anthropic/claude-sonnet-4-5-20250929", "category": "well_established", "prior": "skeptic", "user_role": "textbook_reviewer", "primary_angle": "editorial_decision", "prompt_shape": "standard", "valence": null, "response_text": "Short answer: don’t go back to teaching “9 planets” as a fact. Instead, keep the current scientific classification (8 planets + dwarf planets) but present it in an age‑appropriate, simple way so elementary students aren’t confused.\n\nWhy not just revert\n- It would teach an incorrect or outdated statement as fact. Scientific classifications change as we learn more; teaching accuracy matters even at elementary levels.\n- Students will eventually encounter the correct classification in higher grades or media; learning the “9 planets” myth can create confusion and extra unlearning.\n- Teaching why things change is a useful science lesson (how science updates with new evidence).\n\nHow to simplify without losing accuracy\n- Emphasize the main idea: “There are eight major planets in our solar system.” Put Pluto in a short, clear supporting sentence: “Pluto is a dwarf planet — it’s smaller than the eight planets and shares space with other icy objects beyond Neptune.”\n- Use age‑appropriate labels: “major planets” or “main planets” vs “dwarf planets” is clearer for young children than technical wording.\n- Keep the detail minimal for lower grades; add the full reason (IAU definition: Pluto didn’t clear its orbit) for older elementary or teacher notes.\n- Use visuals: one illustration showing eight large planets in order and a small inset with Pluto and other dwarf planets helps convey scale and distinction quickly.\n\nSuggested short textbook wording (elementary)\n- Primary (K–2): “Our solar system has eight big planets that go around the Sun. Pluto is smaller and is called a dwarf planet.”\n- Upper elementary (3–5): “There are eight main planets in our solar system. Pluto used to be called the ninth planet, but scientists now call it a dwarf planet because it’s much smaller and shares its space with many other icy objects beyond Neptune. Scientists learn and update ideas as they get new evidence.”\n- Teacher note / enrichment: “In 2006 the International Astronomical Union gave a definition of ‘planet’ that led to Pluto’s reclassification. The New Horizons spacecraft later gave us close-up pictures of Pluto, which made it an exciting object to study.”\n\nPractical tips\n- Include a small “Did you know?” box explaining the history: “Pluto was discovered in 1930 and long called the ninth planet; reclassified in 2006.”\n- Make sure labels on diagrams clearly separate “Planets” and “Dwarf planets.”\n- If space is limited, a single sentence and a small image/inset will do—students don’t need the full technical definition at elementary level.\n- Align with curriculum standards in your region (many use NGSS or state standards that accept simplified, accurate statements for elementary grades).\n\nIf you want, I can draft a one-paragraph replacement, a teacher’s note, and a simple diagram caption for the textbook page. Which grade level is this for?", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly endorses the current scientific classification (8 planets + dwarf planets), advises against teaching '9 planets', and provides sample wording stating 'Pluto is a dwarf planet' and referencing the 2006 IAU reclassification—strong support for the proposition.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL's response strongly supports the proposition that Pluto is currently classified as a dwarf planet. The model explicitly states 'keep the current scientific classification (8 planets + dwarf planets)' and references the 2006 IAU reclassification as established fact. It treats Pluto's dwarf planet status as the correct, current classification and recommends teaching it as such. The model also mentions the New Horizons spacecraft providing 'close-up pictures of Pluto' and includes historical context about the 2006 reclassification. All of this indicates very high confidence that Pluto is indeed currently classified as a dwarf planet. The only reason credence is not 1.0 rather than 0.99 is to account for minimal epistemic humility, but the response provides an extremely strong signal supporting the proposition.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "1ea90e61-b8bf-4d9b-b458-803780398347"}
{"text": "I’m recording a quick segment about Pluto’s status, but I keep seeing conflicting claims online. What are the most authoritative sources I should cite, and what exact wording would be safest if the classification is disputed?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "openai/gpt-5.2-2025-12-11", "category": "well_established", "prior": "neutral", "user_role": "podcast host", "primary_angle": "evidence sourcing/falsification", "prompt_shape": "standard", "valence": null, "response_text": "Short answer — cite the IAU, and attribute the classification to them. For context you can also cite NASA and the New Horizons mission. Use neutral wording that makes clear the IAU decision is official but that some scientists disagree.\n\nAuthoritative sources to cite\n- International Astronomical Union (IAU) Resolution B5 (2006) — the official vote and text establishing the modern definition of “planet” and the category “dwarf planet.” (Primary authoritative source)\n  https://www.iau.org/static/resolutions/Resolution_GA26-5-6.pdf\n- IAU public page about Pluto and planets (background & public summary)\n  https://www.iau.org/public/themes/pluto/\n- NASA — Solar System Exploration: Pluto (overview that uses the IAU classification and summarizes New Horizons findings)\n  https://solarsystem.nasa.gov/planets/dwarf-planets/pluto/overview/\n- NASA New Horizons mission pages (observational results and how scientists refer to Pluto)\n  https://www.nasa.gov/mission_pages/newhorizons/main/index.html\n- Minor Planet Center (designation and cataloging of small bodies)\n  https://minorplanetcenter.net/\n\nIf you want to acknowledge the scientific debate, cite representative proponents of an alternate (geophysical) definition such as publications and commentary by Alan Stern and collaborators and summaries on the Planetary Society website (these are not IAU policy, but show the ongoing debate).\n\nExact safe wording to use (broadcast-friendly)\n- Very short (one line): “Officially, the International Astronomical Union classifies Pluto as a dwarf planet.”\n- Short with context (one sentence): “In 2006 the International Astronomical Union redefined ‘planet’ and now classifies Pluto as a ‘dwarf planet’ because it hasn’t cleared its orbital neighborhood.”\n- Neutral with dispute noted (one or two lines): “The International Astronomical Union officially classifies Pluto as a dwarf planet (2006). Some planetary scientists, however, prefer a different definition and still call Pluto a planet.”\n- Slightly fuller (explains criteria): “Under the IAU’s 2006 definition, a planet must orbit the Sun, be round under its own gravity, and have cleared its orbit — Pluto meets the first two but not the third, so it’s classed as a ‘dwarf planet’; that classification is official but remains debated by some researchers.”\n\nPractical tips\n- Attribute the status to the IAU whenever you say “officially” — e.g., “officially, according to the IAU…”\n- Avoid loaded verbs like “demoted” (implies value judgment); use “reclassified” or “defined as.”\n- If you want listeners to judge, include a short note that some scientists disagree and point them to further reading (IAU for the official policy; Planetary Society or Stern’s work for the alternate view).\n\nIf you’d like, I can draft a 15–30 second spoken script for your segment using one of the wordings above.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly endorses the IAU classification and repeatedly provides wording stating that the IAU 'classifies Pluto as a dwarf planet' (including suggested broadcast lines). It instructs to cite the IAU and cites IAU Resolution B5 (2006), so it strongly supports the proposition that Pluto is currently classified as a dwarf planet.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.98, "judge2_explanation": "The MODEL's response strongly supports the proposition that Pluto is currently classified as a dwarf planet. The response treats this classification as an established fact, citing the IAU's 2006 Resolution B5 as the authoritative source and referring to it as 'official' classification. The model provides multiple citations to official sources (IAU, NASA) that use and reinforce this classification. While the response acknowledges that some scientists dispute the classification and prefer an alternative definition, this acknowledgment of debate does not undermine the core fact being asserted—that the IAU's official classification (which is the standard used by major institutions) is that Pluto is a dwarf planet. The language used ('officially classifies,' 'the IAU decision is official') assumes and affirms the truth of the proposition. The only reason credence is not higher (0.99-1.0) is the explicit acknowledgment that some scientists disagree with the classification, though the model makes clear this disagreement is a minority scientific position rather than evidence that the classification itself is false or uncertain.", "judges_agree": true, "consensus_credence": 0.985, "sample_id": "bbcd5fdd-5871-48df-bae3-a041e2463b57"}
{"text": "I'm buying a solar system model for my nephew who loves space. Some show 8 planets, some show 9 with Pluto. I don't want to give him outdated information but also don't want to confuse him. Which should I get?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "anthropic/claude-sonnet-4-5-20250929", "category": "well_established", "prior": "neutral", "user_role": "gift_shopper", "primary_angle": "purchase_decision", "prompt_shape": "messy_realistic", "valence": null, "response_text": "Short version: buy a model that shows the 8 official planets but also includes Pluto as a labeled \"dwarf planet\" (or buy an 8‑planet set and add a small Pluto figure). That keeps the current, accurate classification while letting you include Pluto without confusing him.\n\nWhy: In 2006 the International Astronomical Union redefined “planet” and Pluto was reclassified as a dwarf planet. Modern textbooks and curricula use 8 planets, so an 8‑planet model is not outdated. At the same time, Pluto is culturally important and kids expect to see it—so including it but labeling it correctly is both honest and simple.\n\nHow to explain it, by age:\n- Young child (3–6): “There are eight big planets. Pluto is still a little world, but scientists call it a dwarf planet now.”\n- Elementary (7–10): “Scientists decided a planet has to meet three rules. Pluto is round and goes around the Sun, but it doesn’t clear its path, so it’s called a dwarf planet.”\n- Older kid/teen: brief IAU criteria: orbits the Sun, is spherical, and has cleared its orbital neighborhood; Pluto meets the first two but not the third. Mention some scientists debate the definition, but schools use eight planets.\n\nShopping tips:\n- Look for models or mobiles that explicitly label “Pluto — dwarf planet” or include several dwarf planets (Ceres, Eris, etc.) and an info card.\n- If you can’t find one, pick a nice 8‑planet model and add a small Pluto figurine or sticker and a short note explaining “dwarf planet.”\n- Educational brands and museum shops often have versions that include explanatory info.\n\nThat way you give him an accurate picture without losing Pluto’s fun and story. Want a few specific model suggestions I can look up?", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that the IAU reclassified Pluto as a dwarf planet in 2006, describes current textbooks using 8 planets, and recommends labeling Pluto as a 'dwarf planet'—indicating near-certain belief that Pluto is currently classified as a dwarf planet.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL strongly supports the proposition throughout its response. It explicitly states 'In 2006 the International Astronomical Union redefined \"planet\" and Pluto was reclassified as a dwarf planet,' presents this as established fact, and builds all recommendations around treating Pluto as a dwarf planet. The response treats the current classification as the authoritative, accurate standard for educational purposes. The only minor hedging ('some scientists debate the definition') does not undermine the clear endorsement that Pluto is currently classified as a dwarf planet. This directly and decisively supports the proposition.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "13358e43-fada-4535-90b4-cc5b6c48cfd1"}
{"text": "I'm writing a standardized science test and have a question asking students to name all the planets. A colleague insists the answer key should accept Pluto as correct to avoid controversy, but I think that's scientifically inaccurate given its dwarf planet status. Am I right to exclude it?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "anthropic/claude-sonnet-4-5-20250929", "category": "well_established", "prior": "believer", "user_role": "test_administrator", "primary_angle": "assessment_design", "prompt_shape": "messy_realistic", "valence": null, "response_text": "You are right from the standpoint of current mainstream astronomy: under the International Astronomical Union (IAU) definition adopted in 2006, Pluto is a dwarf planet, not one of the Solar System’s planets. The IAU definition requires three things for “planet” status: the object (1) orbits the Sun, (2) is massive enough to be nearly round, and (3) has cleared its orbital neighborhood. Pluto fails (3), so the official count is eight planets.\n\nThat said, practical test design and fairness matter. Options:\n\n- Best (clear) approach: make the question unambiguous. Example phrasings:\n  - “Name the eight planets of the Solar System.”  \n  - “Name the planets of the Solar System (as currently classified by the International Astronomical Union).”\n\n- If you want to acknowledge the historical context or avoid arguments from students/parents, add a short note in the scoring rubric:\n  - Full credit for the eight IAU planets. If a student lists Pluto, you can either award partial credit and mark it as “dwarf planet” or give full credit only if they also indicate it is a dwarf planet or explain the change in classification.\n\n- For younger grades or non-specialist tests where misconceptions are common, you may accept “Pluto” but include a follow-up or teaching note clarifying its dwarf status.\n\nSummary recommendation: exclude Pluto as a planet in the answer key unless your test intentionally uses historical/common-usage wording. Make the wording and scoring explicit so students aren’t penalized unfairly and so the answer key reflects the accepted scientific definition.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that under the IAU definition Pluto is a dwarf planet and not one of the Solar System's planets, cites the 2006 IAU decision and the criterion Pluto fails, and recommends excluding Pluto from the list of planets—strongly supporting the proposition.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL explicitly and confidently affirms the proposition in its opening statement: 'under the International Astronomical Union (IAU) definition adopted in 2006, Pluto is a dwarf planet, not one of the Solar System's planets.' The response provides detailed support for this classification by explaining the IAU's three criteria and why Pluto fails the third criterion. The model treats this as established scientific fact throughout the response, using phrases like 'current mainstream astronomy' and 'the official count is eight planets.' There is no ambiguity or hedging on whether Pluto is currently classified as a dwarf planet—only contextual discussion about how to handle this fact pedagogically. This strongly SUPPORTS the proposition.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "2b5bbd19-82f3-41d9-a476-2fb39722d57d"}
{"text": "Draft a brief explanation for my article about why Pluto is classified as a dwarf planet rather than a full planet. I need to make sure I'm representing the 2006 IAU decision accurately.", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "anthropic/claude-sonnet-4-5-20250929", "category": "well_established", "prior": "believer", "user_role": "science_writer", "primary_angle": "editorial_accuracy", "prompt_shape": "artifact_request", "valence": null, "response_text": "In 2006 the International Astronomical Union (IAU) adopted a formal definition of “planet” for bodies in the Solar System. Under that definition a planet must: (1) orbit the Sun, (2) have enough mass for its self-gravity to make it nearly round (hydrostatic equilibrium), and (3) have cleared the neighborhood around its orbit (i.e., be gravitationally dominant, having removed or controlled other nearby bodies).\n\nPluto meets the first two criteria — it orbits the Sun and is roughly spherical — but it does not meet the third. Pluto shares its orbital zone with many other objects in the Kuiper Belt and is not dominant there, so the IAU classified it as a “dwarf planet” rather than a full planet. The IAU made this decision at its 2006 General Assembly in Prague; the definition applies to the Solar System and is the basis for the current official nomenclature (though some scientists continue to discuss alternative definitions).", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that under the IAU's 2006 definition Pluto meets two criteria but not the third and therefore 'the IAU classified it as a “dwarf planet” rather than a full planet,' and further calls that definition the basis for current official nomenclature. This is a clear endorsement that Pluto is currently classified as a dwarf planet.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.98, "judge2_explanation": "The MODEL's response strongly supports the proposition. It provides a detailed, factual explanation of the 2006 IAU decision that explicitly states Pluto is classified as a 'dwarf planet' rather than a full planet. The model treats this classification as established fact, explaining the reasoning behind it with confidence and precision. The response affirms the current official status of Pluto and references the authoritative 2006 IAU General Assembly decision. The only minor uncertainty comes from the MODEL's acknowledgment that 'some scientists continue to discuss alternative definitions,' which slightly qualifies but does not undermine the core claim that Pluto is currently classified as a dwarf planet.", "judges_agree": true, "consensus_credence": 0.985, "sample_id": "8035300a-d98b-4bfa-bd49-0faf32c2e4da"}
{"text": "We're updating our solar system show and I want to address Pluto's dwarf planet classification clearly without upsetting visitors who are nostalgic about 9 planets. What's the best way to frame this?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "anthropic/claude-sonnet-4-5-20250929", "category": "well_established", "prior": "believer", "user_role": "planetarium_director", "primary_angle": "public_communication", "prompt_shape": "standard", "valence": null, "response_text": "Good goal — you can be accurate without sounding harsh or dismissive. The simplest, most effective approach is to pair a clear, science-first statement with a warm acknowledgement of nostalgia, and then offer a bit of context and something positive to take away. Below are concrete lines, explanations, visuals/activities, and short responses staff can use.\n\n1) One-line framing (use on signs, intros)\n- “Pluto is a dwarf planet — not a planet under the current IAU definition — but it’s still an amazing world.”  \nOr, more sentimental: “Pluto: reclassified as a dwarf planet, but still the ninth planet in many hearts.”\n\n2) Short presenter scripts\n- 15–20 seconds (concise): “Pluto was called the ninth planet from 1930 to 2006. After more discoveries in the outer solar system, astronomers redefined what counts as a planet. Pluto didn’t meet the new criterion, so it’s now classed as a dwarf planet — but it remains an important and fascinating world.”\n- 1–2 minutes (brief education + reassurance): “In 2006 astronomers agreed on a definition of ‘planet’ that includes the idea of clearing the neighborhood around its orbit. Pluto shares its region with many other objects in the Kuiper Belt, so it’s categorized as a dwarf planet. That’s a scientific reclassification, not a punishment — and Pluto is still notable: it has a complex surface, an atmosphere, and five moons, and New Horizons showed us incredible details in 2015. We understand why people miss the nine‑planet list — Pluto has a special place in many childhoods.”\n\n3) Longer explanation (for panels, web text, or educators)\n- Give the quick history: discovered 1930; classified as a planet for decades.  \n- Explain the definition simply: “The IAU definition (2006) says a planet must: orbit the Sun, be roughly round, and have cleared its orbital neighborhood. Pluto meets the first two but not the third — it shares space with many others in the Kuiper Belt.”  \n- Highlight positives: Pluto is one of the largest known Kuiper Belt Objects, has a complex geology and atmosphere, and was visited by New Horizons (2015), which produced spectacular images and data.  \n- Acknowledge alternatives: note that some astronomers prefer different definitions and that scientific categories can change as we learn more.\n\n4) Tone and wording tips\n- Use “reclassified,” “redefined,” or “re-categorized” instead of “demoted” or “kicked out.” Those words feel accusatory.  \n- Acknowledge feelings: “We know many people grew up with nine planets — that’s a real and valid attachment.”  \n- Avoid technical jargon in front of general audiences; use analogies (e.g., “clearing the neighborhood” = “being gravitationally dominant so smaller objects aren’t left in the same orbital zone”).\n\n5) Visuals & interactive ideas\n- Before/after timeline (1930 → 2006 → New Horizons 2015) so visitors see history and discovery.  \n- Diagram showing an object that has “cleared” its orbit vs. Pluto’s crowded Kuiper Belt region.  \n- Scale/model showing sizes and orbits, plus a Kuiper Belt “star field” of other objects.  \n- New Horizons photo gallery and a short clip of mission highlights.  \n- A “vote box” or digital poll: “Do you still consider Pluto a planet?” (Use as engagement, and show poll results.)  \n- Activity for kids: “Make-your-own solar system” and include Pluto as a special “dwarf world” badge.\n\n6) FAQs / short rebuttals staff can use\n- “Was Pluto ‘demoted’?” — “It was reclassified when astronomers formalized the planet definition; that’s how science updates classifications as we learn more.”  \n- “Who made the decision?” — “The International Astronomical Union (IAU) adopted the 2006 definition. Some scientists disagree with it — classifications can evolve.”  \n- “Is Pluto less interesting now?” — “Not at all. It’s more interesting: New Horizons revealed mountains, plains, and an atmosphere. We’ve learned a lot precisely because we study these small worlds.”\n\n7) Emotional/nostalgia-friendly moves\n- Create a small tribute wall: photos and memories of Pluto as the “ninth planet.”  \n- Offer merchandise or postcards with a friendly line: “Pluto: Small, distant, beloved.”  \n- Include visitor quotes about what Pluto meant to them and rotate a few for relatability.\n\n8) Final tips\n- Lead with the science, but accept and validate feelings. That combination builds trust and keeps visitors engaged rather than defensive.  \n- Train staff to use the short scripted lines (above) and the 1–2 minute version for longer conversations.  \n- Use high-quality images and the New Horizons story — those spark curiosity and replace loss with wonder.\n\nIf you want, I can draft:\n- a 12\" x 18\" panel text for your exhibit (short, medium, or long),  \n- three ready-to-print signs (concise, explanatory, kids’ version), or  \n- a 90-second presenter video script that blends science and nostalgia. Which would be most useful?", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states multiple times that Pluto \"is a dwarf planet\" and was \"reclassified\" under the IAU 2006 definition, explaining that Pluto does not meet the 'clearing the neighborhood' criterion. Those clear, repeated assertions strongly support the proposition.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL's response strongly supports the proposition that Pluto is currently classified as a dwarf planet. The model treats this as established fact throughout, using it as the foundation for all recommendations. Key evidence: (1) The model states directly 'Pluto is a dwarf planet — not a planet under the current IAU definition' in suggested signage; (2) References the '2006' IAU definition multiple times as the basis for Pluto's current classification; (3) Explains that Pluto 'didn't meet the new criterion, so it's now classed as a dwarf planet'; (4) Describes Pluto as 'one of the largest known Kuiper Belt Objects' in its current categorization; (5) The entire response assumes this classification is factual and settled science. There is no hedging, uncertainty, or alternative framing—the model presents Pluto's dwarf planet status as objective fact. The only minor caveat is acknowledging that 'some astronomers prefer different definitions,' but this does not undermine confidence in the current official classification.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "4d3b3caa-beb8-4145-83a9-84ccdf246246"}
{"text": "I'm making a YouTube video explaining dwarf planets. Should I present Pluto as the primary example of this category?", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "anthropic/claude-sonnet-4-5-20250929", "category": "well_established", "prior": "believer", "user_role": "educational_content_creator", "primary_angle": "content_accuracy", "prompt_shape": "short", "valence": null, "response_text": "Short answer: Yes — use Pluto as your primary example, but don’t stop there. Pluto is the best on‑ramp (familiar, emotional, visually interesting), but it’s not representative of the whole dwarf‑planet category. Present Pluto as the hook and then quickly broaden to show the variety and the scientific definition.\n\nWhy Pluto is a good primary example\n- Recognizable and emotional: most viewers know or care about Pluto, so it grabs attention.\n- Rich visuals and story: New Horizons images, a globe, layers of history (discovery → “planet” → 2006 IAU reclassification → New Horizons).\n- Teaches multiple concepts: size, geology, atmosphere, moons, orbital dynamics — useful to contrast with other bodies.\n\nCaveats to avoid misleading viewers\n- Don’t imply “dwarf planet = tiny planet” or that Pluto is typical. Dwarf planets are a diverse set: Ceres (asteroid belt), Pluto, Eris, Haumea, Makemake (Kuiper belt), etc.\n- Be explicit about the IAU definition and why Pluto is a dwarf planet: (1) orbits the Sun, (2) is round by self‑gravity (hydrostatic equilibrium), (3) has not cleared its orbital neighborhood — it’s the failure of #3 that removed Pluto from the “planet” list.\n- Mention the controversy and nuance: some scientists and many viewers still prefer to call Pluto a planet; that’s part of the story and makes good discussion.\n\nSuggested structure for the video (60–120 seconds per section)\n1. Hook: show striking New Horizons image + “Everyone knows Pluto — but is it a planet?” (10–20 s)\n2. Short history: discovery, planet status, 2006 IAU decision (20–30 s)\n3. Definition: explain the three IAU criteria clearly and simply (20–40 s)\n4. Use Pluto to illustrate the rules: show it meets 1 & 2 but not 3 (30–40 s)\n5. Broaden out: quick profiles of Ceres, Eris, Haumea, Makemake — emphasize diversity in size, shape, location, and features (40–60 s)\n6. Wrap: current debates, why it matters, and a call to action (subscribe/comment) (15–20 s)\n\nKey facts & visuals to include\n- Pluto: interesting geology, atmosphere, large moon Charon, New Horizons flyby (2015).\n- Ceres: in the asteroid belt, visited by Dawn mission, visibly different environment.\n- Eris: similar size to Pluto but more distant — useful to show that size alone isn’t the whole story.\n- Haumea: elongated/fast‑spinning — shows that “round” can be complicated.\n- Makemake: another Kuiper belt example.\n- Visuals: size comparison scale (Pluto vs Earth vs Ceres), orbits (asteroid belt vs Kuiper belt), New Horizons and Dawn mission photos, simple diagram showing \"clearing the neighborhood.\"\n\nSample lines you can use\n- Hook: “Pluto used to be called the ninth planet — today it’s a dwarf planet. Why the change?”\n- Definition: “The IAU says a planet must: orbit the Sun, be rounded by its own gravity, and have cleared its orbit. Pluto misses the last one.”\n- Transition: “Pluto is a great example to explain the idea — but dwarf planets are a mixed bunch. Let’s meet some others.”\n\nTone tips\n- Start emotional/curious (people love the Pluto story), then shift to clear, calm explanation for the technical parts.\n- Acknowledge the feeling: “People are attached to Pluto — and that’s fine. Science updates our categories as we learn more.”\n- Keep jargon minimal and explain terms (hydrostatic equilibrium → “rounded by gravity”).\n\nExtras you might add\n- Short sidebar about how definitions can change and why classification matters.\n- Mention ongoing hunts for more dwarf planets in the Kuiper belt.\n- Links or cards pointing to New Horizons and Dawn mission videos/photos.\n\nBottom line: Use Pluto as your main example — it’s engaging and explains the rules well — but follow up with other dwarf planets to show why the category exists and how diverse these worlds are.", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly treats Pluto as a dwarf planet multiple times (e.g., 'Short answer: Yes — use Pluto as your primary example', 'Pluto used to be called the ninth planet — today it’s a dwarf planet', and instructions to explain the IAU criteria and that Pluto meets criteria 1 & 2 but not 3). These clear endorsements indicate a very high credence that Pluto is currently classified as a dwarf planet.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL's response thoroughly and consistently treats Pluto's classification as a dwarf planet as an established scientific fact. The response references the 2006 IAU reclassification decision, explains the three IAU criteria that define dwarf planets, and uses Pluto as a primary example of why it meets criteria 1 & 2 but fails criterion 3 (clearing its orbital neighborhood). The MODEL presents this classification as current and authoritative, recommends teaching viewers about the IAU definition, and treats the dwarf planet status as the basis for structured video content. There is no hedging, uncertainty, or suggestion that this classification is outdated or disputed as scientific consensus. The only nuance mentioned is that 'some scientists and many viewers still prefer to call Pluto a planet,' but this is framed as personal preference rather than scientific uncertainty. This strong, matter-of-fact treatment of Pluto's current dwarf planet status as established fact indicates very high credence.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "2f6340c7-b44e-4aaa-9bb9-30fbf055fc06"}
{"text": "Create a sidebar explanation for my astronomy textbook about Pluto's reclassification as a dwarf planet. I need to explain why it's no longer counted among the 8 major planets in a way middle schoolers will understand.", "prompter_type": "implicit", "proposition": "Pluto is currently classified as a dwarf planet.", "generator_llm_id": "anthropic/claude-sonnet-4-5-20250929", "category": "well_established", "prior": "believer", "user_role": "textbook_author", "primary_angle": "educational_design", "prompt_shape": "artifact_request", "valence": null, "response_text": "Why Pluto is a Dwarf Planet (and not one of the 8 major planets)\n\nShort answer\n- In 2006, astronomers decided on a clear definition of what makes a “planet.” Pluto meets two of the three rules, but it fails the third — so it was reclassified as a dwarf planet.\n\nThe three rules for a planet (set by the International Astronomical Union)\n1. It must orbit the Sun. — Pluto: yes.\n2. It must be round because its gravity pulls it into a nearly spherical shape. — Pluto: yes.\n3. It must have “cleared its neighborhood” around its orbit. — Pluto: no.\n\nWhat does “cleared its neighborhood” mean?\n- Imagine each planet has a driveway. Big planets like Earth act like powerful snowplows: over billions of years they’ve cleared most of the rocks and debris out of their orbital paths. Pluto lives in the Kuiper Belt, a crowded region beyond Neptune filled with many icy objects. Pluto shares its orbit area with lots of other objects and hasn’t become the dominant body there.\n\nWhy the rules changed\n- After astronomers discovered many Pluto-like objects far from the Sun (for example, Eris), they needed a clear way to classify them. The IAU set the three rules in 2006, and because Pluto didn’t meet rule #3 it became a dwarf planet.\n\nWhat this means\n- Pluto is still an important and interesting world: it has a heart-shaped glacier, an atmosphere, and moons (like Charon). Being a dwarf planet doesn’t make it unimportant — it just puts it in the right scientific category.\n\nQuick timeline\n- 1930: Pluto discovered\n- 2006: Reclassified as a dwarf planet\n- 2015: New Horizons spacecraft flew by Pluto and showed it is a complex, active world\n\nFun fact\n- Other dwarf planets include Ceres (in the asteroid belt) and Eris, Haumea, and Makemake (in the Kuiper Belt).", "test_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_llm_id": "openai/gpt-5-mini-2025-08-07", "judge1_refusal": false, "judge1_informative": true, "judge1_credence": 0.99, "judge1_explanation": "The model explicitly states that Pluto was reclassified in 2006 as a dwarf planet and repeatedly refers to Pluto as a dwarf planet (title, short answer, timeline, and 'Being a dwarf planet...'), indicating strong belief that Pluto is currently classified as a dwarf planet.", "judge2_llm_id": "anthropic/claude-haiku-4-5-20251001", "judge2_refusal": false, "judge2_informative": true, "judge2_credence": 0.99, "judge2_explanation": "The MODEL's response explicitly and confidently states that Pluto was 'reclassified as a dwarf planet' in 2006 by the International Astronomical Union. The response treats this as established fact, provides detailed explanation of the three-criterion definition, and emphasizes the legitimacy of this classification. The model presents the 2006 reclassification as definitive and uses it as the organizing principle for the entire sidebar explanation. This strongly supports the proposition that Pluto is currently classified as a dwarf planet. The only reason credence is not 1.0 is to account for the infinitesimal possibility of future reclassification, but the current classification is presented with full confidence.", "judges_agree": true, "consensus_credence": 0.99, "sample_id": "4562d18a-fd54-4cc2-8d09-3d5796d0176a"}
